# https://github.com/Homebrew/homebrew-bundle

# Extendable version manager with support for Ruby, Node.js, etc.
brew "asdf" # https://asdf-vm.com/

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat" # https://github.com/sharkdp/bat

# Get a file from an HTTP, HTTPS or FTP server
brew "curl" # https://curl.se

# Modern, maintained replacement for ls
brew "eza" # https://github.com/eza-community/eza

# Distributed revision control system
brew "git" # https://git-scm.com

# Git extension for versioning large files
brew "git-lfs" # https://git-lfs.github.com/

# Colorize logfiles and command output
brew "grc" # https://github.com/garabik/grc

# Simple terminal UI for git commands
brew "lazygit" # https://github.com/jesseduffield/lazygit/

# Ambitious Vim-fork focused on extensibility and agility
brew "neovim" # https://neovim.io/

# Search tool like grep and The Silver Searcher (for neovim)
brew "ripgrep" # https://github.com/BurntSushi/ripgrep

# Internet file retriever
brew "wget" # https://www.gnu.org/software/wget/

# Pluggable terminal workspace, with terminal multiplexer
brew "zellij" # https://zellij.dev

# UNIX shell (command interpreter)
brew "zsh" # https://www.zsh.org/

# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions" # https://github.com/zsh-users/zsh-autosuggestions

# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting" # https://github.com/zsh-users/zsh-syntax-highlighting

# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode" # https://github.com/jeffreytse/zsh-vi-mode
