# Bundler for dependencies from Homebrew, Homebrew Cask, and Mac App Store
# https://github.com/Homebrew/homebrew-bundle

# === Packages ===

brew "awscli"
# Official Amazon AWS command-line interface
# https://aws.amazon.com/cli/

brew "bat"
# Clone of cat(1) with syntax highlighting and Git integration
# https://github.com/sharkdp/bat

brew "btop"
# Resource monitor
# https://github.com/aristocratos/btop

brew "curl"
# Get a file from an HTTP, HTTPS or FTP server
# https://curl.se

brew "direnv" # (pco-box/devbox dependency)
# Load/unload environment variables based on $PWD
# https://direnv.net/

brew "eza"
# Modern, maintained replacement for ls
# https://github.com/eza-community/eza

brew "fd" # (neovim dependency)
# Simple, fast and user-friendly alternative to find
# https://github.com/sharkdp/fd

brew "fzf" # (neovim dependency)
# Command-line fuzzy finder written in Go
# https://github.com/junegunn/fzf

brew "gh"
# GitHub command-line tool
# https://cli.github.com

brew "git"
# Distributed revision control system
# https://git-scm.com

brew "grc"
# Colorize logfiles and command output
# https://github.com/garabik/grc

brew "lazygit"
# Simple terminal UI for git commands
# https://github.com/jesseduffield/lazygit/

brew "lua-language-server"
# Language Server for the Lua language
# https://github.com/LuaLS/lua-language-server

brew "mas"
# Mac App Store command-line interface
# https://github.com/mas-cli/mas

brew "neovim"
# Ambitious Vim-fork focused on extensibility and agility
# https://neovim.io/

brew "node"
# Open-source, cross-platform JavaScript runtime environment
# https://nodejs.org/

brew "ollama"
# Create, run, and share large language models (LLMs)
# https://ollama.com

brew "opencode"
# The AI coding agent built for the terminal.
# https://github.com/sst/opencode

brew "powerlevel10k"
# Prompt theme for zsh
# https://github.com/romkatv/powerlevel10k

brew "ripgrep" # (neovim dependency)
# Search tool like grep and The Silver Searcher (for neovim)
# https://github.com/BurntSushi/ripgrep

brew "ruby"
# Powerful, clean, object-oriented scripting language
# https://www.ruby-lang.org/

brew "stylua"
# Opinionated Lua code formatter
# https://github.com/JohnnyMorganz/StyLua

brew "wget"
# Internet file retriever
# https://www.gnu.org/software/wget/

brew "yq"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
# https://github.com/mikefarah/yq

brew "zellij"
# Pluggable terminal workspace, with terminal multiplexer
# https://zellij.dev

brew "zsh"
# UNIX shell (command interpreter)
# https://www.zsh.org/

brew "zsh-autosuggestions"
# Fish-like fast/unobtrusive autosuggestions for zsh
# https://github.com/zsh-users/zsh-autosuggestions

brew "zsh-completions"
# Additional completion definitions for zsh
# https://github.com/zsh-users/zsh-completions

brew "zsh-syntax-highlighting"
# Fish shell like syntax highlighting for zsh
# https://github.com/zsh-users/zsh-syntax-highlighting

brew "zsh-vi-mode"
# Better and friendly vi(vim) mode plugin for ZSH
# https://github.com/jeffreytse/zsh-vi-mode


# === Applications ===

cask "1password"
# Password manager that keeps all passwords secure behind one password
# https://1password.com/

cask "asana"
# Manage team projects and tasks
# https://asana.com/

cask "brave-browser"
# Web browser focusing on privacy
# https://brave.com/

cask "cleanmymac"
# Tool to remove unnecessary files and folders from disk
# https://macpaw.com/cleanmymac

cask "cleanshot"
# Screen capturing tool
# https://getcleanshot.com/

cask "copilot-money"
# Track and budget money
# https://copilot.money/

cask "firefox@developer-edition"
# Web browser
# https://www.mozilla.org/firefox/developer/

cask "ghostty"
# Terminal emulator that uses platform-native UI and GPU acceleration
# https://ghostty.org

cask "logi-options+"
# Software for Logitech devices
# https://www.logitech.com/en-us/software/logi-options-plus.html

cask "monitorcontrol"
# Tool to control external monitor brightness & volume
# https://github.com/MonitorControl/MonitorControl

cask "notion"
# App to write, plan, collaborate, and get organised
# https://www.notion.so/

cask "notion-calendar"
# Calendar for professionals and teams
# https://www.notion.com/product/calendar

cask "opal-composer"
# Professional webcam software for the Opal C1
# https://opalcamera.com/opal-composer

cask "proton-drive"
# Client for Proton Drive
# https://proton.me/drive

cask "proton-mail"
# Client for Proton Mail and Proton Calendar
# https://proton.me/mail

cask "protonvpn"
# VPN client focusing on security
# https://protonvpn.com/

cask "rapidapi"
# HTTP client that helps testing and describing APIs
# https://paw.cloud/

cask "raycast"
# Spotlight replacement productivity tool
# https://raycast.com/

cask "slack"
# Team communication and collaboration software
# https://slack.com/

cask "spotify"
# Music streaming service
# https://www.spotify.com/

mas "Things 3", id: 904280696
# Personal task manager
# https://culturedcode.com/things/

cask "tuple"
# Remote pair programming app
# https://tuple.app/

cask "zoom"
# Video communication and virtual meeting platform
# https://www.zoom.us/


# === Fonts ===

cask "font-geist-mono-nerd-font"
