# Bundler for dependencies from Homebrew, Homebrew Cask, and Mac App Store
# https://github.com/Homebrew/homebrew-bundle


# === Packages ===

brew "asdf"
# Extendable version manager with support for Ruby, Node.js, etc.
# https://asdf-vm.com/

brew "awscli"
# Official Amazon AWS command-line interface
# https://aws.amazon.com/cli/

brew "bat"
# Clone of cat(1) with syntax highlighting and Git integration
# https://github.com/sharkdp/bat

brew "btop"
# Resource monitor
# https://github.com/aristocratos/btop

brew "coreutils" # (asdf dependency)
# GNU File, Shell, and Text utilities
# https://www.gnu.org/software/coreutils

brew "curl"
# Get a file from an HTTP, HTTPS or FTP server
# https://curl.se

brew "direnv" # (pco-box/devbox dependency)
# Load/unload environment variables based on $PWD
# https://direnv.net/

brew "eza"
# Modern, maintained replacement for ls
# https://github.com/eza-community/eza

brew "git"
# Distributed revision control system
# https://git-scm.com

brew "grc"
# Colorize logfiles and command output
# https://github.com/garabik/grc

brew "lazygit"
# Simple terminal UI for git commands
# https://github.com/jesseduffield/lazygit/

brew "mas"
# Mac App Store command-line interface
# https://github.com/mas-cli/mas

brew "neovim"
# Ambitious Vim-fork focused on extensibility and agility
# https://neovim.io/

brew "powerlevel10k"
# Prompt theme for zsh
# https://github.com/romkatv/powerlevel10k

brew "ripgrep" # (neovim dependency)
# Search tool like grep and The Silver Searcher (for neovim)
# https://github.com/BurntSushi/ripgrep

brew "wget"
# Internet file retriever
# https://www.gnu.org/software/wget/

brew "zellij"
# Pluggable terminal workspace, with terminal multiplexer
# https://zellij.dev

brew "zsh"
# UNIX shell (command interpreter)
# https://www.zsh.org/

brew "zsh-autosuggestions"
# Fish-like fast/unobtrusive autosuggestions for zsh
# https://github.com/zsh-users/zsh-autosuggestions

brew "zsh-syntax-highlighting" 
# Fish shell like syntax highlighting for zsh
# https://github.com/zsh-users/zsh-syntax-highlighting

brew "zsh-vi-mode"
# Better and friendly vi(vim) mode plugin for ZSH
# https://github.com/jeffreytse/zsh-vi-mode


# === Applications ===

cask "1password"
# Password manager that keeps all passwords secure behind one password
# https://1password.com/

cask "asana"
# Manage team projects and tasks
# https://asana.com/

cask "cleanmymac"
# Tool to remove unnecessary files and folders from disk
# https://macpaw.com/cleanmymac

cask "cleanshot" 
# Screen capturing tool
# https://getcleanshot.com/

cask "copilot"
# Track and budget money
# https://copilot.money/

cask "firefox@developer-edition"
# Web browser
# https://www.mozilla.org/firefox/developer/

cask "hyperkey"
# Convert caps lock key to the hyper key
# https://hyperkey.app/

cask "keymapp" 
# ZSA keyboard firmware flasher
# https://www.zsa.io/flash

cask "logi-options+"
# Software for Logitech devices
# https://www.logitech.com/en-us/software/logi-options-plus.html

cask "monitorcontrol" 
# Tool to control external monitor brightness & volume
# https://github.com/MonitorControl/MonitorControl

cask "nordvpn"
# VPN client for secure internet access and private browsing
# https://nordvpn.com/

cask "notion"
# App to write, plan, collaborate, and get organised
# https://www.notion.so/

cask "opal-composer"
# Professional webcam software for the Opal C1
# https://opalcamera.com/opal-composer

cask "raycast"
# Spotlight replacement productivity tool
# https://raycast.com/

cask "readdle-spark"
# Email client
# https://sparkmailapp.com/

cask "slack"
# Team communication and collaboration software
# https://slack.com/

cask "spotify"
# Music streaming service
# https://www.spotify.com/

cask "synology-drive" 
# Sync and backup service to Synology NAS drives
# https://www.synology.com/

cask "todoist"
# To-do list
# https://todoist.com/home

cask "tuple"
# Remote pair programming app
# https://tuple.app/

cask "visual-studio-code"
# Open-source code editor
# https://code.visualstudio.com/

cask "wezterm"
# GPU-accelerated cross-platform terminal emulator and multiplexer
# https://wezfurlong.org/wezterm/

cask "zoom"
# Video communication and virtual meeting platform
# https://www.zoom.us/


# === Fonts ===

cask "font-geist-mono-nerd-font"